tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "xz"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "btop"
brew "python@3.12"
brew "chezmoi"
brew "chruby"
brew "cmake"
brew "libssh2"
brew "curl"
brew "direnv"
brew "doctl"
brew "dotnet"
brew "dotnet@6"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git"
brew "handbrake"
brew "hashcat"
brew "htop"
brew "navi"
brew "neovim"
brew "node"
brew "openvino"
brew "pipenv"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-install"
brew "rust"
brew "ssh-copy-id"
brew "tmux"
brew "wget"
brew "yarn"
brew "hashicorp/tap/terraform"
brew "heroku/brew/heroku"
cask "alacritty"
cask "appcleaner"
cask "betterdisplay"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "jdownloader"
cask "stats"
cask "visual-studio-code"
cask "vlc"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onelight"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dhedgecock.radical-vscode"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.github-vscode-theme"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "juanmnl.vscode-theme-1984"
vscode "kaiwood.endwise"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.wordcount"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
