# Dotfiles Brewfile - Mac Setup
# Run: brew bundle install

# Taps
tap 'homebrew/bundle'
tap 'homebrew/services'

# Essential CLI Tools
brew 'git'
brew 'zsh'
brew 'curl'
brew 'wget'
brew 'tree-sitter'
brew 'fzf'
brew 'ripgrep'
brew 'btop'
brew 'htop'
brew 'tmux'
brew 'neovim'
brew 'navi'
brew 'direnv'
brew 'gh'

# Development Tools
brew 'node'
brew 'yarn'
brew 'python@3.13'
brew 'python@3.12'
brew 'python@3.11'
brew 'python@3.10'
brew 'pipenv'
brew 'pipx'
brew 'rust'
brew 'go'
brew 'terraform'
brew 'ansible'
brew 'awscli'
brew 'doctl'
brew 'flyctl'
brew 'heroku'

# Ruby/Version Management
brew 'rbenv'
brew 'ruby-build'
brew 'ruby-install'
brew 'chruby'

# System Tools
brew 'cmake'
brew 'make'
brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'pkg-config'
brew 'openssl@3'
brew 'ca-certificates'

# Media/Graphics
brew 'ffmpeg'
brew 'imagemagick'
brew 'vips'

# Databases
brew 'postgresql@14'
brew 'redis'
brew 'sqlite'

# Security/Networking
brew 'gnupg'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'ssh-copy-id'
brew 'hashcat'

# File Management
brew 'chezmoi'
brew 'unzip'
brew 'rsync'

# Productivity Casks
cask '1password-cli'
cask 'visual-studio-code'
cask 'google-chrome'
cask 'alacritty'
cask 'stats'
cask 'betterdisplay'
cask 'amethyst'
cask 'appcleaner'
cask 'vlc'
cask 'veracrypt'
cask 'jdownloader'
cask 'openscad'
cask 'macfuse'

# Fonts
cask 'font-fira-code'
cask 'font-fira-sans'
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store (requires mas CLI)
# brew "mas"
# mas "Xcode", id: 497799835
